In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("master_df.csv", index_col = 'date')

In [3]:
type(df.head())

pandas.core.frame.DataFrame

In [4]:
master_df = df.copy()

In [9]:
df.reset_index(inplace = True) # convert index column:date to regular column:date

In [10]:
df['date']=pd.to_datetime(df['date']) # convert datatype from string to datetime

In [11]:
df['year'] = pd.DatetimeIndex(df['date']).year # extract year numbner
df['month'] = pd.DatetimeIndex(df['date']).month # extract month number
df['month'] = pd.to_datetime(df['month'], format='%m').dt.month_name() # convert month number to month name
df['month'] = df['month'].str.lower() # lower case month names for consistency

In [13]:
df.tail()

             date   country visa_type  number  year    month
142183 2020-10-01  Zimbabwe        G1      11  2020  october
142184 2020-10-01  Zimbabwe        G4      13  2020  october
142185 2020-10-01  Zimbabwe        J1       2  2020  october
142186 2020-10-01  Zimbabwe        K1       1  2020  october
142187 2020-10-01  Zimbabwe        M1       1  2020  october

In [14]:
df.set_index('date', inplace = True) # assign column:date as index

In [15]:
df.head()

                country visa_type  number  year  month
date
2017-03-01  Afghanistan        A1      14  2017  march
2017-03-01  Afghanistan        A2      42  2017  march
2017-03-01  Afghanistan        B1       1  2017  march
2017-03-01  Afghanistan     B1/B2      87  2017  march
2017-03-01  Afghanistan        F2       1  2017  march

In [16]:
returned_country = 'Afghanistan'
returned_visa_type = 'A2'
returned_month = 'march'
returned_year = '2017'

In [17]:
result = df[(df['country'] == returned_country) & (df['visa_type'] == returned_visa_type) & (df['month'] == returned_month) & (df['year']==int(returned_year))]

In [18]:
result

                country visa_type  number  year  month
date
2017-03-01  Afghanistan        A2      42  2017  march

In [19]:
    result = result['number'].values

In [20]:
result

array([42], dtype=int64)

In [21]:
import pandas as pd
master_df = pd.read_csv('master_df.csv', index_col='date')
# Filtering data from master_df
# - creating columns year and month out of the date index
master_df.reset_index(inplace=True)  # convert index column:date to regular column:date
master_df['date'] = pd.to_datetime(master_df['date'])  # convert datatype from string to datetime
master_df['year'] = pd.DatetimeIndex(master_df['date']).year  # extract year numbner
master_df['month'] = pd.DatetimeIndex(master_df['date']).month  # extract month number
master_df['month'] = pd.to_datetime(master_df['month'],
                                    format='%m').dt.month_name()  # convert month number to month name
master_df['month'] = master_df['month'].str.lower()  # lower case month names for consistency
master_df.set_index('date', inplace=True)  # assign column:date as index

# - actual filtering
result = master_df[(master_df['country'] == returned_country) &
                   (master_df['visa_type'] == returned_visa_type) &
                   (master_df['month'] == returned_month) &
                   (master_df['year'] == int(returned_year))]
result = result['number'].values[0]

In [22]:
result

42

# Work Here
### Dealing with option :all

In [26]:
master_df.head()

                country visa_type  number  year  month
date
2017-03-01  Afghanistan        A1      14  2017  march
2017-03-01  Afghanistan        A2      42  2017  march
2017-03-01  Afghanistan        B1       1  2017  march
2017-03-01  Afghanistan     B1/B2      87  2017  march
2017-03-01  Afghanistan        F2       1  2017  march

In [68]:
returned_country = 'Nepal'
returned_visa_type = 'F1'
returned_month = 'all'
returned_year = '2018'

In [74]:
result = master_df.copy().reset_index(drop = True)
cols = list(result.columns)

if returned_country != 'all':
    result = result[result['country'] == returned_country]
    cols.remove('country')

if returned_month != 'all':
    result = result[result['month'] == returned_month]
    cols.remove('month')
    
if returned_year !='all':
    result = result[result['year']==int(returned_year)]
    cols.remove('year')

if returned_visa_type != 'all' : 
    result = result[result['visa_type'] == returned_visa_type]
    cols.remove('visa_type')
    
result = result[cols].reset_index(drop = True)

In [75]:

print('Results for Country, visa_type, Month, Year')
print(f'Results for {returned_country}, {returned_visa_type}, {returned_month}, {returned_year}')
result

Results for Country, visa_type, Month, Year
Results for Nepal, F1, all, 2018

    number      month
0       75    january
1       13   february
2       12      march
3       69      april
4      358        may
5      542       june
6      300       july
7       80     august
8        9  september
9       35    october
10     128   november
11     162   december

### Filtering columns for option : all

In [52]:
cols = list(result.columns)

In [53]:
cols

['country', 'visa_type', 'number', 'year', 'month']

In [55]:
cols.remove('country')
cols

ValueError: list.remove(x): x not in list

In [76]:
master_df.head()

                country visa_type  number  year  month
date
2017-03-01  Afghanistan        A1      14  2017  march
2017-03-01  Afghanistan        A2      42  2017  march
2017-03-01  Afghanistan        B1       1  2017  march
2017-03-01  Afghanistan     B1/B2      87  2017  march
2017-03-01  Afghanistan        F2       1  2017  march

In [80]:
master_df[(master_df['country'] == 'Nepal') & (master_df['month'] == 'october')& (master_df['year'] == 2020)]

           country visa_type  number  year    month
date
2020-10-01   Nepal        A1       6  2020  october
2020-10-01   Nepal        A2       2  2020  october
2020-10-01   Nepal     B1/B2     409  2020  october
2020-10-01   Nepal        C1       1  2020  october
2020-10-01   Nepal      C1/D       1  2020  october
2020-10-01   Nepal        F1       7  2020  october
2020-10-01   Nepal        G4      28  2020  october
2020-10-01   Nepal        H4       1  2020  october
2020-10-01   Nepal        J1       9  2020  october
2020-10-01   Nepal        J2       4  2020  october
2020-10-01   Nepal        K1       1  2020  october
2020-10-01   Nepal        K2       1  2020  october